back-end/app/models/user.rb

    def games_played
        self.games.count
---
SELECT COUNT(*) FROM "games" WHERE "games"."user_id" = ?  [["user_id", 2]]

    def average_score
        allScore = 0
        self.games.each do |game|
---
SELECT "games".* FROM "games" WHERE "games"."user_id" = ?  [["user_id", 2]]

    def holes_played
        self.scorecards.count
---
SELECT COUNT(*) FROM "scorecards" INNER JOIN "games" ON "scorecards"."game_id" = "games"."id" WHERE "games"."user_id" = ?  [["user_id", 2]]

    def average_throws_per_hole
        totalThrows = 0
        self.scorecards.each do |card|
---
SELECT "scorecards".* FROM "scorecards" INNER JOIN "games" ON "scorecards"."game_id" = "games"."id" WHERE "games"."user_id" = ?  [["user_id", 2]]