back-end/app/controllers/dg_courses_controller.rb

    def index
        courses = DgCourse.all
---
SELECT "dg_courses".* FROM "dg_courses"