back-end/app/controllers/games_controller.rb

SELECT "games".* FROM "games"
---
    def index
        games = Game.all

SELECT "scorecards".* FROM "scorecards" WHERE "scorecards"."game_id" = ?  [["game_id", 1]]
SELECT "dg_courses".* FROM "dg_courses" WHERE "dg_courses"."DGCourseReviewApiId" = ? LIMIT ?  [["DGCourseReviewApiId", 562], ["LIMIT", 1]]
INSERT INTO "games" ("user_id", "dg_course_id", "score", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["user_id", 1], ["dg_course_id", 29], ["score", 32], ["created_at", "2020-05-18 15:41:29.187108"], ["updated_at", "2020-05-18 15:41:29.187108"]]
INSERT INTO "games" ("user_id", "dg_course_id", "score", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["user_id", 1], ["dg_course_id", 29], ["score", 36], ["created_at", "2020-05-18 15:27:01.236214"], ["updated_at", "2020-05-18 15:27:01.236214"]]
INSERT INTO "scorecards" ("game_id", "strokeCount", "holeNum", "parCount", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["game_id", 5], ["strokeCount", 6], ["holeNum", 2], ["parCount", 4], ["created_at", "2020-05-18 15:47:28.577526"], ["updated_at", "2020-05-18 15:47:28.577526"]]
---
    def create
        finalScore = 0
        userScoreCard = params["finalScoreCard"]
        userScoreCard.each do |hole|
            finalScore = finalScore + hole["stroke"] end
        dgCourseID = params["course"]["course_id"].to_i
        coursePlayed = DgCourse.find_by(DGCourseReviewApiId: params["course"]["course_id"].to_i)
        playerGame = Game.create(user_id: params["user"][0]["id"], dg_course_id: coursePlayed.id, score: finalScore )
        userScoreCard.each do |hole|
            Scorecard.create(game_id: playerGame.id, strokeCount: hole["stroke"].to_i, holeNum: hole["hole"].to_i, parCount: hole["par"].to_i)