back-end/app/controllers/users_controller.rb

    def show
        user = User.find(params[:id])
---
SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]

    def create
        @user = User.new(user_params)
        @user.password_digest = BCrypt::Password.create(params["password"])
        if @user.valid?
            @user.save
---
INSERT INTO "users" ("email", "password_digest", "firstName", "lastName", "street", "city", "state", "zip", "userImg", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?)

    def update
        byebug
        @user = User.find_by(id: params[:id])
        @user.update(user_params)
---
SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
UPDATE "users" SET "password_digest" = ?, "updated_at" = ? WHERE "users"."id" = ?  [["password_digest", "$2a$12$WViriQAenG4Jc3BxW6GLZ.D5qTS9QiWYmvyE6fqVXVRP4SnbkbpOq"], ["updated_at", "2020-05-19 21:24:09.826992"], ["id", 1]]

    def add_friend
        friendship1 = UserFriend.find_or_create_by(user_id: params[:user_id], friend_id: params[:friend_id])
        friendship2 = UserFriend.find_or_create_by(user_id: params[:friend_id], friend_id: params[:user_id])
---
INSERT INTO "user_friends" ("user_id", "friend_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["user_id", 2], ["friend_id", 3], ["created_at", "2020-05-20 00:16:24.504249"], ["updated_at", "2020-05-20 00:16:24.504249"]]
SELECT "user_friends".* FROM "user_friends" WHERE "user_friends"."user_id" = ? AND "user_friends"."friend_id" = ? LIMIT ?  [["user_id", 2], ["friend_id", 3], ["LIMIT", 1]]
SELECT "user_friends".* FROM "user_friends" WHERE "user_friends"."user_id" = ? AND "user_friends"."friend_id" = ? LIMIT ?  [["user_id", 3], ["friend_id", 2], ["LIMIT", 1]]

    def remove_friend
        friendship = UserFriend.find_by(id: params["_json"][0][:id])
        friendship.destroy
---
SELECT "user_friends".* FROM "user_friends" WHERE "user_friends"."id" = ? LIMIT ?  [["id", 26], ["LIMIT", 1]]
DELETE FROM "user_friends" WHERE "user_friends"."id" = ?  [["id", 26]]