back-end/app/controllers/users_controller.rb

    def update
        @user = User.find_by(id: params[:id])
        @user.update(user_params)
        @user.password_digest = BCrypt::Password.create(params["password"])
        @user.save
---
UPDATE "users" SET "street" = ?, "city" = ?, "state" = ?, "zip" = ?, "updated_at" = ? WHERE "users"."id" = ?  [["street", "111 Waverly Avenue - Suite 200"], ["city", "Syracuse"], ["state", "NY"], ["zip", 13244], ["updated_at", "2020-05-15 18:33:37.535687"], ["id", 1]]
UPDATE "users" SET "password_digest" = ?, "updated_at" = ? WHERE "users"."id" = ?  [["password_digest", "$2a$12$5dSm8K9cjFYrwNBmJvM7eeYJueKibpjtrC1AO2NV46ulVFXoXOntK"], ["updated_at", "2020-05-15 18:33:37.873683"], ["id", 1]]